[
  {
    "Title": "Service Restored",
    "Timestamp": "2016-03-28T17:22:43.511Z",
    "Content": "<h1>Qi Service Update – Downtime Complete</h1> At this time the March 24, 2016 deployment of a new version of the Qi service is complete and the service is now available.\r\nTypes, streams, and behaviors will need to be recreated and any data previously stored in Qi will no longer be available.\r\nThis deployment introduces new service features requiring updates to your client side code. A summary of the new service\r\nfeatures as well as references to the documentation to help you resume use of the service can be found below:\r\n<h2>Namespaces</h2> Namespaces are used to separate tenants into logical entities. The definition of types, streams and behaviors will now be\r\ndefined at the Namespace level as opposed to the tenant level creating an independent list of Type, Stream and Stream Behavior\r\nobjects for each Namespace within a tenant. It is required that you create at least one Namespace within your tenant. You\r\ncan reference the Quick start section of the documentation here to create your first Namespace and begin writing to that\r\nnamespace. Also, the samples within the Qi-Samples repository on GitHub have been updated to reflect the new features of\r\nthe service.\r\n<h2>tenantId Parameter</h2> Tenant ID’s will now be referenced in all Qi calls. Your tenantID for ************ is: ************ An example of the client\r\nside code changes necessary for Namespaces and the tenantID parameter using GetOrCreateType( ) is shown below:\r\n<blockquote>\r\n    <h3>Qi API</h3>\r\n    <code>QiType GetOrCreateType(string tenantId, string namespaceId, QiType qitype);\r\n         Task<QiType> GetOrCreateTypeAsync(string tenantId, string namespaceId, QiType qitype);</code>\r\n    <h3>Http</h3>\r\n    <code>POST Qi/{tenantId}/{namespaceId}/Types</code>\r\n</blockquote>"
  },
  {
    "Title": "Service Outage",
    "Timestamp": "2016-03-28T15:00:12.511Z",
    "Content": "<h1>Service Outage<\/h1>\r\nAt 12:00 PM PDT, Qi will be unavailable so the development team can perform an upgrade to the service. The outage should last about 3 hours. A bulletin will be posted here when the maintenance is complete."
  }
]
