[{
    "Title": "Upgrade Starting",
    "Timestamp": "2016-04-01T18:25:00.511Z",
    "Content": "<h1>Qi Service Upgrade Staring<\/h1> At 18:25 UTC OSIsoft will begin an upgrade to the Qi service. The upgrade includes changes to repair and improve the functionality of the service. Once the upgrade is complete namespaces, types, streams, and behaviors will need to be recreated and any data previously stored in Qi will no longer be available. We apologize for this inconvenience and will continue to improve the upgrade process moving forward."
  },{
    "Title": "Upgrade Complete - Action required",
    "Timestamp": "2016-03-29T12:22:43.511Z",
    "Content": "<h1>Qi Service Upgrade Complete - Action required<\/h1> OSIsoft performed an upgrade to the Qi service. Namespaces, types, streams, and behaviors will need to be recreated and any data previously stored in Qi will no longer be available. We apologize for this inconvenience and we are working towards resolving all the reported issues."
  },{
    "Title": "Upgrade Complete - Action required",
    "Timestamp": "2016-03-28T17:22:43.511Z",
    "Content": "<h1>Qi Service Upgrade Complete - Action required<\/h1> OSIsoft performed an upgrade to the Qi service. The upgrade included critical changes to repair and improve the functionality of the service. Namespaces, types, streams, and behaviors will need to be recreated and any data previously stored in Qi will no longer be available. We apologize for this inconvenience and will continue to improve the upgrade process moving forward."
  },
  {
    "Title": "Service Restored",
    "Timestamp": "2016-03-24T17:22:43.511Z",
    "Content": "<h1>Qi Service Update - Service Restored<\/h1> At this time a new version of the Qi service is complete and the service is now available.Types, streams, and behaviors will need to be recreated and any data previously stored in Qi will no longer be available. This deployment introduces new service features requiring updates to your client side code. A summary of the new service features as well as references to the documentation to help you resume use of the service can be found below: <h2>Namespaces<\/h2> Namespaces are used to separate tenants into logical entities. The definition of types, streams and behaviors will now be defined at the Namespace level as opposed to the tenant level creating an independent list of Type, Stream and Stream Behavior nobjects for each Namespace within a tenant. It is required that you create at least one Namespace within your tenant. You can reference the Quick start section of the documentation here to create your first Namespace and begin writing to that namespace. Also, the samples within the Qi-Samples repository on GitHub have been updated to reflect the new features of the service. <h2>tenantId Parameter<\/h2> Tenant IDs will now be referenced in all Qi calls. Your tenantID for ************ is: ************ An example of the client side code changes necessary for Namespaces and the tenantID parameter using GetOrCreateType( ) is shown below: <blockquote>     <h3>Qi API<\/h3>     <code>QiType GetOrCreateType(string tenantId, string namespaceId, QiType qitype);          Task<QiType> GetOrCreateTypeAsync(string tenantId, string namespaceId, QiType qitype);<\/code>     <h3>Http<\/h3>     <code>POST Qi\/{tenantId}\/{namespaceId}\/Types<\/code> <\/blockquote>"
  },
  {
    "Title": "Service Outage",
    "Timestamp": "2016-03-24T15:00:12.511Z",
    "Content": ":<h1>Qi Service Update - Downtime<\/h1> Today OSIsoft will begin the deployment of a new version of the Qi service. This deployment will require a downtime of approximately 2 hours. Once the deployment is complete types, streams, and behaviors will need to be recreated and any data currently stored in Qi will no longer be available. This deployment will introduce new service features requiring updates to your client side code. You will receive a messaging following the completion of this downtime including updated references to documentation and Samples covering the new service features."
  }
]
